validation/interFoamCyclic/system/controlDict
FoamFile { version 2.0; format ascii; class dictionary; object controlDict; }
application     interFoam;
startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         0.02;
deltaT          0.002;
writeControl    runTime;
writeInterval   0.02;
purgeWrite      0;
writeFormat     ascii;
writePrecision  17;
writeCompression off;
timeFormat      general;
timePrecision   6;
runTimeModifiable no;
adjustTimeStep  no;
maxCo           0.5;
maxAlphaCo      0.5;
maxDeltaT       1;
