validation/interFoamCyclic/system/blockMeshDict
FoamFile { version 2.0; format ascii; class dictionary; object blockMeshDict; }
// A PERIODIC two-phase channel: x is cyclic, y is walled, z is one cell thick (empty). 800 cells.
// Small on purpose -- this fixture exists so interFoam's CYCLIC path can be run end to end against
// real OpenFOAM on both arms, not to be a physics case.
scale 1;
vertices ( (0 0 0)(1 0 0)(1 0.5 0)(0 0.5 0) (0 0 0.05)(1 0 0.05)(1 0.5 0.05)(0 0.5 0.05) );
blocks ( hex (0 1 2 3 4 5 6 7) (40 20 1) simpleGrading (1 1 1) );
edges ();
boundary (
    left  { type cyclic; neighbourPatch right; faces ( (0 4 7 3) ); }
    right { type cyclic; neighbourPatch left;  faces ( (1 2 6 5) ); }
    walls { type wall;  faces ( (0 1 5 4) (3 7 6 2) ); }
    frontAndBack { type empty; faces ( (0 3 2 1) (4 5 6 7) ); }
);
