validation/interFoamCyclic/0.orig/alpha.water
FoamFile { version 2.0; format ascii; class volScalarField; object alpha.water; }
dimensions      [0 0 0 0 0 0 0];
internalField   uniform 0;
boundaryField
{
    walls        { type zeroGradient; }
    "(left|right)" { type cyclic; }
    frontAndBack { type empty; }
}
