validation/interFoamCyclic/system/fvSolution
FoamFile { version 2.0; format ascii; class dictionary; object fvSolution; }
solvers
{
    "alpha.water.*"
    {
        nAlphaCorr      2;
        nAlphaSubCycles 1;
        cAlpha          1;
        MULESCorr       yes;
        nLimiterIter    3;
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-12;
        relTol          0;
    }
    "pcorr.*"   { solver PCG; preconditioner DIC; tolerance 1e-10; relTol 0; }
    p_rgh       { solver PCG; preconditioner DIC; tolerance 1e-12; relTol 0; }
    p_rghFinal  { $p_rgh; relTol 0; }
    "(U|k|epsilon).*" { solver smoothSolver; smoother symGaussSeidel; tolerance 1e-12; relTol 0; }
}
PIMPLE
{
    momentumPredictor   no;
    nOuterCorrectors    1;
    nCorrectors         3;
    nNonOrthogonalCorrectors 0;
    pRefCell            0;
    pRefValue           0;
}
